#+TITLE: Extract Genes from Variant Genotype
#+AUTHOR: Tong, Xiaoran
#+STARTIP: overview 
#+REVEAL_ROOT: https://cdn.jsdelivr.net/npm/reveal.js
#+REVEAL_THEME: beige
#+OPTIONS: num:nil
#+OPTIONS: ^:{}
#+PROPERTY: header-args:sh :eval no
#+PROPERTY: EXPORT_REVEAL_MARGIN: 50

* Get Test Genotype
  - for demonstration, use *1000 genomes phase 3*;
    * the phase 3 sequencing aligns to GRCh37;
    * variant data is host on [[ftp://ftp.1000genomes.ebi.ac.uk/vol1/ftp/release/20130502/][EBI FTP]] site and [[ftp://ftp-trace.ncbi.nih.gov/1000genomes/ftp/release/20130502/][NCBI Mirror]];
    * existing downloads on MSU HPCC:
      */mnt/research/StatGen/kgp/raw/000*
  - use chromosome 7, 13, and 22 as examples, copy the three into *~/gsp*
  #+REVEAL: split
  - inspect genotype data in VCF
    #+BEGIN_SRC sh :exports both :eval yes
    cd ~/gsp			# working directory
    ls -lgGh [0-9][0-9].vcf.gz*	# exam variants in chromosomes
    #+END_SRC

    #+RESULTS:
    | -rw-r-x--- | 1 | 866M | Sep | 2 | 23:52 | 07.vcf.gz     |
    | -rw-r-x--- | 1 | 155K | Sep | 2 | 23:52 | 07.vcf.gz.tbi |
    | -rw-r-x--- | 1 | 532M | Sep | 2 | 23:52 | 13.vcf.gz     |
    | -rw-r-x--- | 1 | 95K  | Sep | 2 | 23:52 | 13.vcf.gz.tbi |
    | -rw-r-x--- | 1 | 205M | Sep | 2 | 23:52 | 22.vcf.gz     |
    | -rw-r-x--- | 1 | 36K  | Sep | 2 | 23:52 | 22.vcf.gz.tbi |

  - the genotype is in block compressed VCF (variant call format).
    - .vcf.gz*    : the main data;
    - .vcfgz.tbi* : allow random access of any variant.
  #+REVEAL: split
  - to ease later operations, convert the data into PLINK BED format;
  - during the conversion, keep only 
    - bi-allelic variant
    - single nucleotide polymorphism (i.e., SNP).
    #+BEGIN_SRC sh :eval no
      cd ~/gsp
      # VCF to PLINK BED
      plink2 --vcf 07.vcf.gz --snps-only --max-alleles 2 --make-bed --out 07
      plink2 --vcf 13.vcf.gz --snps-only --max-alleles 2 --make-bed --out 13
      plink2 --vcf 22.vcf.gz --snps-only --max-alleles 2 --make-bed --out 22

      # cleanup
      rm -f *.log
    #+END_SRC
  - Note: padding "0" before single digit chromosome helps sorting files.
    #+REVEAL: split
  - inspect the results of conversion
    #+BEGIN_SRC sh :exports both :eval yes
      cd ~/gsp
      ls -lGgh [0-9][0-9]*.{bed,bim,fam}
    #+END_SRC

    #+RESULTS:
    | -rw-r----- | 1 | 2.7G | Sep | 3 | 07:53 | 07.bed |
    | -rw-r----- | 1 | 126M | Sep | 3 | 07:53 | 07.bim |
    | -rw-r----- | 1 | 47K  | Sep | 3 | 07:53 | 07.fam |
    | -rw-r----- | 1 | 1.6G | Sep | 3 | 07:54 | 13.bed |
    | -rw-r----- | 1 | 78M  | Sep | 3 | 07:54 | 13.bim |
    | -rw-r----- | 1 | 47K  | Sep | 3 | 07:54 | 13.fam |
    | -rw-r----- | 1 | 631M | Sep | 3 | 07:54 | 22.bed |
    | -rw-r----- | 1 | 30M  | Sep | 3 | 07:54 | 22.bim |
    | -rw-r----- | 1 | 47K  | Sep | 3 | 07:54 | 22.fam |

** extract one gene
   For example, *TMEM196*
   - located on chromosome 7;
   - basepair from 19,719,315 to 19,773,617;
   - aligned to assembly GRCh37;
   - add 5000 basepair to both ends of the gene.
   #+REVEAL: split
   #+BEGIN_SRC sh
     cd ~/gsp
     a=$[19719315+5000]
     b=$[19773617-5000]

     # use plink to extrat TMEM196 from PLLINK BED files
     plink --bfile 07 --chr 07 --from-bp $a --to-bp $b --make-bed --out TMEM196 &>/dev/null

     # use bcftools to extrat TMEM196 from block compressed VCF.
     bcftools view 07.vcf.gz -r 07:$a-$b -Oz -o TMEM196.vcf.gz

     # cleanup
     rm -f *.{log,nosex}
   #+END_SRC

   - inspect the results
   #+BEGIN_SRC sh :eval yes
     cd ~/gsp
     ls -lgGh TMEM196.*
   #+END_SRC

   #+RESULTS:
   | -rw-r----- | 1 | 880K | Sep | 3 | 07:37 | TMEM196.bed    |
   | -rw-r----- | 1 | 41K  | Sep | 3 | 07:37 | TMEM196.bim    |
   | -rw-r----- | 1 | 47K  | Sep | 3 | 07:37 | TMEM196.fam    |
   | -rw-r----- | 1 | 8.7K | Sep | 3 | 07:37 | TMEM196.vcf.gz |

